[
    {
        "id": "inspireit",
        "title": "Software Engineer",
        "entity": {
            "logoUrl": "/images/logo-inspireit.png",
            "name": "Inspire IT Portugal"
        },
        "startDate": "Oct 2019",
        "endDate": "Present",
        "sectionDescription": [
            {
                "title": null,
                "description": [
                    "As a Inspire IT maker, helped finalize the website and customer portal of Portugal propane gas trading company, Gascan, using ASP.NET Core 2.2, JQuery, Dapper and SQL as development technologies, implementing new features and fixing bugs.",
                    "Migrated the project of one of the biggest education group of Peru, from database first to code first and from Entity Framework to Dapper ORM. Also was implemented Onion architecture in the project to contain new features and gradually move previous features made to the new structure."
                ]
            },
            {
                "title": "Cofidis Portugal",
                "description": [
                    "Helped Cofidis Portugal, as an outsourcing collaborator, in the creation and digital transformation of its products, contributing to the team to which belongs to plan, create and migrate applications, and supporting them in the choices of the architecture to implement as well as participating in the developments.",
                    "Participated in Telemetry Team and Test-driven development (TDD) team, helping them implement development standards to be followed by all teams.",
                    "Created REST APIs and Micro Services from scratch, according to new developments and roadmap defined for the digital transformation.",
                    "Created a log nugget during the participation in Telemetry team, to be used by all teams and facilitate their developments giving them a solution to this sensitive theme with main purpose of eliminate simple information dump, facility their process of analyzing an information flow,  direct logs to different profiles (System Admins, DEV, Support, among others), ensure compliance with security standards (eg.: GDPR), and monitor the performance of applications and features.",
                    "Configured build and release pipelines, in Azure DevOps, for new APIs developed by the team.",
                    "Implemented Mautic Marketing Automation in the Cofidis ecosystem to be used by the Marketing department in their campaigns, leaving them with all the configurations completed and providing them knowledge sessions to understand how the platform works.",
                    "Main technologies used: .NET Core, .NET 5, .NET Framework 4.5+, SQL, SSIS, PostgreSQL, Hangfire, Dapper, Entity Framework, Onion Architecture, RabbitMQ, Mautic."
                ]
            },
            {
                "title": "Pestana Hotel Group",
                "description": [
                    "Helped Pestana Hotel Group, as an outsourcing collaborator, to implement new features and fix bugs that appear in booking flows.",
                    "Interacted with Internet Information Services (IIS) and Azure DevOps to deploy REST and SOAP APIs used in booking system."
                ]
            }
        ],
        "visitButton": {
            "text": "View company",
            "url": "https://inspireit.pt/en/"
        }
    },
    {
        "id": "inspireit_trainee",
        "title": "Software Engineer Trainee",
        "entity": {
            "logoUrl": "/images/logo-inspireit.png",
            "name": "Inspire IT Portugal"
        },
        "startDate": "Jul 2019",
        "endDate": "Sep 2019",
        "sectionDescription": [
            {
                "title": null,
                "description": [
                    "Started Software Engineer career as an intern at Inspire IT Portugal, located in Almada, participating in two projects that allowed to learn more about continuous delivery (CD), API architectures, design patterns and SOLID principles.",
                    "Both projects had a combination of React with Redux for frontend and .NET Core 2.1 API, Onion Architecture, SQL and Dapper ORM for backend.",
                    "The first project worked on was the company's internal portal, which was created to computerize manual tasks performed daily or monthly by employees, but mainly by the human resources team.",
                    "The second project worked on arose from a challenge made to the interns about who would deliver a base project for access control, routes and attendance of employees with a database, architecture and some features completed for the team that would continue it. Ended up to accept the challenge and delivering it as requested, with great satisfaction as the product is now in production and being used by companies."
                ]
            }
        ],
        "visitButton": {
            "text": "View company",
            "url": "https://inspireit.pt/en/"
        }
    }
]