[
    {
        "id": "portfolio",
        "title": "Porfolio",
        "entity": {
            "name": "Own"
        },
        "endDate": "Apr 2022",
        "stack": [
            "Next.js",
            "TypeScript"
        ],
        "sectionDescription": [
            {
                "title": null,
                "description": [
                    "A portfolio is a compilation of materials that exemplifies our beliefs, skills, qualifications, education, training and experiences. It provides insight into our personality and work ethic.",
                    "To represent and be a reflection of all the topics mentioned in the description above, this portfolio project was created, which was also a tool to obtain more knowledge of Next.js, React and functionalities offered by them."
                ]
            },
            {
                "title": "Contribution",
                "description": [
                    "Responsible for all steps of portfolio creation, from design, choice of stack, coding and creation of the content that should be included in it."
                ]
            },
            {
                "title": "Technical Sheet",
                "description": [
                    "Technologies involved on this project:",
                    "- Next.js",
                    "- Typescript",
                    "- React",
                    "- React hooks",
                    "- Sass",
                    "- CSS Modules",
                    "- Adobe xd"
                ]
            }
        ],
        "images": [
            {
                "url": "/images/projects/portfolio.jpg",
                "alt": "Portfolio image"
            }
        ],
        "visitButton": {
            "text": "View repo",
            "url": "https://github.com/adilsonmsoares/portfolio"
        },
        "categories": [
            "software",
            "design"
        ]
    },
    {
        "id": "mautic",
        "title": "Mautic Marketing Automation",
        "entity": {
            "name": "Cofidis Portugal"
        },
        "startDate": "Sep 2021",
        "stack": [
            "Mautic",
            ".NET Core 3.1"
        ],
        "sectionDescription": [
            {
                "title": null,
                "description": [
                    "Mautic is an open source marketing automation platform that provides us with the greatest level of audience intelligence, thus enabling us to make more meaningful customer connections.",
                    "Based on the features and functionalities offered by the Mautic, it was implemented in the company's ecosystem so that the marketing department would have one more tool at its disposal for campaigns and attracting new customers.",
                    "The implementation involved programming the base of the Platform in parallel with the API that would act as an intermediary between the platform and internal applications."
                ]
            },
            {
                "title": "Contribution",
                "description": [
                    "Regarding the platform I was responsible for configuring and testing it as a whole.",
                    "Responsible for creating the MauticAPI from scratch that would allow communication between the platform and internal applications, and the first functionalities it should have, leaving it documented to be more easily understood.",
                    "Also responsible for implementing the communication of the first internal applications with the platform, via MauticAPI."
                ]
            },
            {
                "title": "Technical Sheet",
                "description": [
                    "Technologies involved on this project:",
                    "- Mautic",
                    "- .NET Core 3.1",
                    "- Hangfire",
                    "- Serilog",
                    "- Onion Architecture",
                    "- Dapper ORM",
                    "- Swagger"
                ]
            }
        ],
        "images": [
            {
                "url": "/images/projects/logo_mautic.png",
                "alt": "Mautic logo image"
            }
        ],
        "visitButton": {
            "text": "View Mautic",
            "url": "https://www.mautic.org/"
        },
        "categories": [
            "software"
        ]
    },
    {
        "id": "dotNetjobAgent",
        "title": ".NET Job Agent",
        "entity": {
            "name": "Cofidis Portugal"
        },
        "endDate": "Sep 2021",
        "stack": [
            ".NET 5.0",
            "HangFire"
        ],
        "sectionDescription": [
            {
                "title": null,
                "description": [
                    "Sometimes, working in the .NET environment, you might feel that .NET could offer a job agent by default, like SQL Job Agent, but this is not the case. To suppress this lack, other developers created Hangfire which runs background jobs and workers in .NET and .NET Core like SQL Job Agent does in SQL Server.",
                    "Hangfire was used initially in one or two projects, but over the time several projects were using it. The company's goal was to have all the background jobs concentrated in one place, even if they belong to different projects and teams. So, this Web API was created to achieve that goal and work as a Job Orchestrator with the ability to manage and monitor background jobs.",
                    "Main features of this Job Orchestrator:",
                    "- List all jobs created",
                    "- Add or update a job",
                    "- Remove a job, based on its ID",
                    "- Authentication with rules",
                    "Other benefits besides those mentioned above is that this Job Orchestrator WebAPI uses Hangfire and its resources to manage background Jobs, but with the possibility of keeping the application pool running while the management is done without shutting down the server."
                ]
            },
            {
                "title": "Contribution",
                "description": [
                    "Responsible for creating the Web API from scratch, including its documentation, and providing presentation meetings with architects and team leaders so that they knew what was being developed and how they could use it in order to help them in the development of their teams."
                ]
            },
            {
                "title": "Technical Sheet",
                "description": [
                    "Technologies involved on this project:",
                    "- .NET 5.0",
                    "- Hangfire",
                    "- Dapper ORM",
                    "- Swagger",
                    "- Serilog",
                    "- xUnit",
                    "- FluentAssertions",
                    "- Onion Architecture"
                ]
            }
        ],
        "images": [
            {
                "url": "/images/projects/dotNetjobAgent/hangfire.png",
                "alt": "Hangfire dashboard"
            },
            {
                "url": "/images/projects/dotNetjobAgent/diagram.jpg",
                "alt": "Nugget flow diagram"
            }
        ],
        "categories": [
            "software"
        ]
    },
    {
        "id": "lognugetpackage",
        "title": "Log Nugget package",
        "entity": {
            "name": "Cofidis Portugal"
        },
        "endDate": "Oct 2021",
        "stack": [
            ".NET Standard",
            "Serilog",
            "ElasticSearch"
        ],
        "sectionDescription": [
            {
                "title": null,
                "description": [
                    "Most companies suffer from a lack of informations to fix bugs in their applications when they appear. To avoid this type of situation, was created this nugget package, which offers ease in its configuration,  log levels and patterns previously defined, identification of the team who the log should be forwarded in case of error, and treatment for private data to  be logged in order with General Data Protection Regulation (GDPR).",
                    "Purpose of this nugget:",
                    "- Reduce the simple dumping of information",
                    "- Facilitate the process of analyzing an information flow",
                    "- Trace the requests flow in detail",
                    "- Centralize information in a single repository",
                    "- Direct logs to different profiles (System Admins, DEV, Support team, among others)",
                    "- Ensuring compliance with security standards (e.g. GDPR)",
                    "- Differentiate Logs by levels (Debug, Warning, Information, Error, among others )",
                    "- Monitor the performance of applications and features",
                    "This nugget package was concepted by the Application Telemetry Team, to be used in .NET Framework 4.5+ and NET Core 2.0+ projects, but with the idea of expanding the logic applied to it in other scopes/languages (e.g. Javascript, Python)."
                ]
            },
            {
                "title": "Contribution",
                "description": [
                    "Responsible for creating the log nugget from scratch, including its documentation, and providing presentation meetings and knowledge sessions for the teams."
                ]
            },
            {
                "title": "Technical Sheet",
                "description": [
                    "Technologies involved on this project:",
                    "- .NET Core",
                    "- .NET Framework",
                    "- .NET Standard",
                    "- Serilog",
                    "- ElasticSearch",
                    "- Kibana",
                    "- xUnit",
                    "- FluentAssertions"
                ]
            }
        ],
        "images": [
            {
                "url": "/images/projects/log_nugget_package.jpg",
                "alt": "Log nugget package image"
            }
        ],
        "categories": [
            "software"
        ]
    },
    {
        "id": "apiboilerplate",
        "title": "API Boilerplate",
        "entity": {
            "name": "Own"
        },
        "endDate": "Oct 2021",
        "stack": [
            ".NET 5.0",
            "FluentValidation",
            "xUnit"
        ],
        "sectionDescription": [
            {
                "title": null,
                "description": [
                    "This boilerplate was created to serve as a base project for a quick start of an API in .NET, with a structured architecture opened for scalability and easy to maintenance. Its conception results in previous episodes where new developments emerged and the need to have an empty project with basic configurations already defined was felt.",
                    "Below is a list of basic features that this boilerplate API offers:",
                    "- Structured architecture based on layers",
                    "- API request examples",
                    "- Log events using Serilog",
                    "- FluentValidation",
                    "- Unit test examples in xUnit"
                ]
            },
            {
                "title": "Contribution",
                "description": [
                    "Responsible for designing and creating the boilerplate from scratch, choosing the architecture and packages needed for it, as well as basic features it needed to offer."
                ]
            },
            {
                "title": "Technical Sheet",
                "description": [
                    "Technologies involved on this project:",
                    "- .NET 5.0",
                    "- xUnit",
                    "- Onion Architecture",
                    "- Serilog",
                    "- FluentValidation",
                    "- FluentAssertions",
                    "- Moq",
                    "- Dapper ORM",
                    "- Swagger"
                ]
            },
            {
                "description": [
                    "For a more detailed explanation of the chosen architecture and its layers or to start using this boilerplate, go to its git repository by clicking in the button below."
                ]
            }
        ],
        "images": [
            {
                "url": "/images/projects/apiboilerplate/diagram.png",
                "alt": ".NET API Boilerplate diagram"
            },
            {
                "url": "/images/projects/apiboilerplate/swagger.jpg",
                "alt": ".NET API Boilerplate"
            }
        ],
        "visitButton": {
            "text": "View repo",
            "url": "https://github.com/adilsonmsoares/API_Boilerplate"
        },
        "categories": [
            "software"
        ]
    }
]