{"pageProps":{"data":{"id":"dotNetjobAgent","title":".NET Job Agent","entity":{"name":"Cofidis Portugal"},"endDate":"Sep 2021","stack":[".NET 5.0","HangFire"],"sectionDescription":[{"title":null,"description":["Sometimes, working in the .NET environment, you might feel that .NET could offer a job agent by default, like SQL Job Agent does, but this is not the case. To suppress the lack of a default Job Agent in .NET, other developers created Hangfire which runs background jobs and workers in .NET and .NET Core like SQL Job Agent does in SQL Server.","Hangfire was used initially in some projects in Cofidis Company, but over the time lots of projects were using it. The company's goal was to have all the background jobs concentrated in one place, even if they belonged to different projects and teams. So, this Web API was created to achieve that goal and work as a Job Orchestrator with the ability to manage and monitor background jobs.","Main features of this Job Orchestrator:","- List all jobs created","- Add or update a job","- Remove a job, based on its ID","- Authentication with rules","Other benefits besides those mentioned above is that this Job Orchestrator WebAPI uses Hangfire and its resources to manage background Jobs, but with the possibility of keeping the application pool running while the management is done without shutting down the server."]},{"title":"Contribution","description":["I was responsible for creating the Web API from scratch, including its documentation, and providing presentation meetings with architects and team leaders so that they knew what was being developed and how they could use it in order to help them in the development of their teams."]},{"title":"Technical Sheet","description":["Technologies involved on this project:","- .NET 5.0","- Hangfire","- Dapper ORM","- Swagger","- Serilog","- xUnit","- FluentAssertions","- Onion Architecture"]}],"images":[{"url":"/images/projects/dotNetjobAgent/hangfire.png","alt":"Hangfire dashboard"},{"url":"/images/projects/dotNetjobAgent/diagram.jpg","alt":"Nugget flow diagram"}],"categories":["software"]}},"__N_SSG":true}