{"pageProps":{"data":{"id":"inspireit","title":"Software Engineer","entity":{"logoUrl":"/images/logo-inspireit.png","name":"Inspire IT Portugal"},"startDate":"Oct 2019","endDate":"Present","sectionDescription":[{"title":null,"description":["As an Inspire IT maker, I helped finalize the website and customer portal of Portugal propane gas trading company, Gascan, using ASP.NET Core 2.2, JQuery, Dapper and SQL as development technologies, implementing new features and fixing bugs.","I migrated the project of one of the biggest education group in Peru, from database first to code first and from Entity Framework to Dapper ORM. I also implemented Onion architecture in the project to contain new features and gradually move previous features made to the new structure."]},{"title":"Cofidis Portugal","description":["I helped Cofidis Portugal, as an outsourcing collaborator, in the creation and digital transformation of its products, contributing to the team to which I belong to plan, create and migrate applications, supporting them in the choices of the architecture to implement as well as participating in the developments.","While I was involved in my team's projects, I participated in the Application Telemetry Team and Test-driven development (TDD) team parallelly, defining nuggets packages, naming conventions and development standards to be used by company's teams. I helped both teams to analyse company's needs, define objectives to be achieved and document all the work carried out.","I created REST APIs and Micro Services from scratch, according to new developments and roadmap defined for the digital transformation area.","I created a log nugget package while participating in the Application Telemetry team, to be used by all teams to facilitate their developments, giving them a solution to this sensitive theme with the main purpose of eliminate simple information dump, facilitate their process of analyzing an information flow,  direct logs to different profiles (System Admins, DEV, Support, among others), ensure compliance with security standards (e.g. GDPR), and monitor the performance of applications and features.","I configured build and release pipelines, in Azure DevOps, for new APIs developed.","I implemented Mautic Marketing Automation in the Cofidis ecosystem to be used by Marketing department in their campaigns, leaving them with all the configurations completed and providing them knowledge sessions to understand how the platform works.","Main technologies used: .NET Core, .NET 5.0, .NET Framework 4.5+, SQL, SSIS, PostgreSQL, Hangfire, Dapper, Entity Framework, Onion Architecture, RabbitMQ, Mautic."]},{"title":"Pestana Hotel Group","description":["I helped Pestana Hotel Group, as an outsourcing collaborator, to implement new features and fix bugs that appeared in booking flows, and I also interacted with Internet Information Services (IIS) and Azure DevOps to deploy REST and SOAP APIs used in booking system."]}],"visitButton":{"text":"View Inspire IT","url":"https://inspireit.pt/en/"}}},"__N_SSG":true}